{
  "format": "layers-model",
  "generatedBy": "train_bulletproof_v2.py",
  "convertedBy": "Custom sklearn-to-tfjs",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 512,
            "activation": "relu",
            "use_bias": true,
            "name": "dense",
            "batch_input_shape": [
              null,
              100
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 512,
            "activation": "relu",
            "use_bias": true,
            "name": "dense_1"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 256,
            "activation": "relu",
            "use_bias": true,
            "name": "dense_2"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "name": "dense_3"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 26,
            "activation": "softmax",
            "use_bias": true,
            "name": "dense_4"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            100,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            512,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            512,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            256,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_4/kernel",
          "shape": [
            128,
            26
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_4/bias",
          "shape": [
            26
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}